In [2]:
import numpy as np
import pandas as pd

In [8]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3','A4'],
    'B':['B0','B1','B2','B3','B4'],
    'C':['C0','C1','C2','C3','C4'],
    'D':['D0','D1','D2','D3','D4']},
        index=[0,1,2,3,4])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4

In [9]:
df2=pd.DataFrame({'A':['A5','A6','A7','A8','A9'],
    'B':['B5','B6','B7','B8','B9'],
    'C':['C5','C6','C7','C8','C9'],
    'D':['D5','D6','D7','D8','D9']},
        index=[5,6,7,8,9])
df2

    A   B   C   D
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
8  A8  B8  C8  D8
9  A9  B9  C9  D9

In [11]:
pd.concat([df1,df2],axis=1)

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7
8  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9  NaN  NaN  NaN  NaN   A9   B9   C9   D9

In [13]:
left=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']})
left

    C   D Key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [14]:
right=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                  'C':['C4','C5','C6','C7'],
                  'D':['D4','D5','D6','D7']})
right

    C   D Key
0  C4  D4  K0
1  C5  D5  K1
2  C6  D6  K2
3  C7  D7  K3

In [15]:
pd.merge(left,right,how='inner',on='Key')

  C_x D_x Key C_y D_y
0  C0  D0  K0  C4  D4
1  C1  D1  K1  C5  D5
2  C2  D2  K2  C6  D6
3  C3  D3  K3  C7  D7

In [19]:
df=pd.DataFrame({'col':[1,2,3,4],
                'col2':[444,555,666,444],
                'col3':['abc','def','ghi','xyz']})
df.head()

   col  col2 col3
0    1   444  abc
1    2   555  def
2    3   666  ghi
3    4   444  xyz

In [23]:
df['col2'].nunique()

3

In [24]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [30]:
df[(df['col']>2) & (df['col2']==444)]

   col  col2 col3
3    4   444  xyz

In [31]:
def times2(x):
    return x*2

In [35]:
df['col'].apply(times2)

0    2
1    4
2    6
3    8
Name: col, dtype: int64

In [43]:
df.columns

Index(['col', 'col2', 'col3'], dtype='object')

In [44]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [46]:
df.sort_values('col2')

   col  col2 col3
0    1   444  abc
3    4   444  xyz
1    2   555  def
2    3   666  ghi

In [48]:
df.isnull()

     col   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False